/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putchar_fd.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hmatsuba <hmatsuba@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/11/14 14:22:56 by hmatsuba          #+#    #+#             */
/*   Updated: 2024/11/14 14:42:35 by hmatsuba         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

void	ft_putchar_fd(char c, int fd)
{
	write(fd, &c, 1);
}

// int main(void)
// {
//     ft_putchar_fd('A', 1); // 標準出力に 'A' を出力
//     ft_putchar_fd('\n', 1); // 改行を標準出力に出力
//     ft_putchar_fd('B', 2); // 標準エラー出力に 'B' を出力
//     ft_putchar_fd('\n', 2); // 改行を標準エラー出力に出力

//     return (0);
// }